Repository: MElkmeshi/flutter-sms
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: SMS Commands
ar: أوامر الرسائل النصية

# selectCategory
source: Select a Service Category
ar: اختر فئة الخدمة

# selectCategoryDescription
source: Choose from banking, telecom, and government services
ar: اختر من خدمات البنوك والاتصالات والحكومة

# selectProvider
source: Select a Service Provider
ar: اختر مزود الخدمة

# selectProviderDescription
source: Choose from available service providers
ar: اختر من مزودي الخدمات المتاحة

# fillForm
source: Fill the Form
ar: املأ النموذج

# fillFormDescription
source: Complete the form below to generate your SMS
ar: أكمل النموذج أدناه لإنشاء رسالتك النصية

source: SMS Preview
ar: معاينة الرسالة

source: Loading services...
ar: جاري تحميل الخدمات...

source: Loading providers...
ar: جاري تحميل المزودين...

source: No category selected
ar: لم يتم اختيار فئة

# noCategorySelectedDescription
source: Please go back and select a category first
ar: يرجى العودة واختيار فئة أولاً

source: Go Back
ar: العودة

source: Retry
ar: إعادة المحاولة

source: Error
ar: خطأ

source: Unknown state
ar: حالة غير معروفة

source: No action selected
ar: لم يتم اختيار إجراء

source: Send SMS
ar: إرسال الرسالة

# smsAppOpenedSuccess
source: SMS app opened successfully!
ar: تم فتح تطبيق الرسائل بنجاح!

# smsAppFailed
source: Failed to open SMS app
ar: فشل في فتح تطبيق الرسائل

source: About
ar: حول

# aboutDescription
source: Generate SMS commands for various Libyan service providers. Select a category, provider, and action to create your SMS.
ar: إنشاء أوامر رسائل نصية لمختلف مزودي الخدمات الليبيين. اختر فئة ومزود وإجراء لإنشاء رسالتك النصية.

source: OK
ar: موافق

source: providers
ar: مزودين

source: actions
ar: إجراءات

source: Enter {field}
ar: أدخل {field}

# fieldRequired
source: {field} is required
ar: {field} مطلوب

source: Form Fields
ar: حقول النموذج

source: Clear All
ar: مسح الكل

source: Saved
ar: محفوظ

source: Saved Values
ar: القيم المحفوظة

# noSavedValues
source: No saved values yet
ar: لا توجد قيم محفوظة بعد

# noSavedValuesHint
source: Enter a value and save it for quick access
ar: أدخل قيمة واحفظها للوصول السريع

source: Save Current Value
ar: حفظ القيمة الحالية

# valueName
source: Name
ar: الاسم

# valueNameHint
source: e.g. My Account
ar: مثال: حسابي

# valueNameRequired
source: Name is required
ar: الاسم مطلوب

source: Delete saved value?
ar: حذف القيمة المحفوظة؟

source: Dial USSD
ar: طلب USSD

source: USSD Preview
ar: معاينة كود USSD

# ussdDialerOpenedSuccess
source: USSD dialer opened successfully!
ar: تم فتح طالب USSD بنجاح!

# ussdDialerFailed
source: Failed to open USSD dialer
ar: فشل في فتح طالب USSD
